In this notebook, we are going to use pandas to *read excel* Files.

In [1]:
import os
print(os.getcwd())

C:\Users\abuyu

In [2]:
os.chdir("C:\\Users\\abuyu\\Downloads")

Import the **pandas** module. Here, we want to see that how many sheets we've in the excel file. We use **pd.ExcelFile()** method to import the data. Then we use **xl.sheet_names** to check the name of the sheets.

In [18]:
import pandas as pd
pd.__version__ # pandas version

'0.21.1'

In [19]:
xl = pd.ExcelFile("battledeath.xlsx")
xl.sheet_names

['2002', '2004']

Now, we parse the fisrt sheet **2002** using the **.parse()** method.

In [4]:
df2002 = xl.parse(sheet_name = '2002')
df2002.head() # Checking the first 5 rows.

  War, age-adjusted mortality due to       2002
0                        Afghanistan  36.083990
1                            Albania   0.128908
2                            Algeria  18.314120
3                            Andorra   0.000000
4                             Angola  18.964560

Also, we can use integers to selct the desired sheet. 
The following is for the 2nd sheet (*2004*).

In [6]:
df2004 = xl.parse(sheet_name = 1) # 1 because we are dealing with zero-based index positions.
df2004.head()

  War(country)      2004
0  Afghanistan  9.451028
1      Albania  0.130354
2      Algeria  3.407277
3      Andorra  0.000000
4       Angola  2.597931

We can do some customization on our data import. Say, we are interseted to skip the first 2 rows and rename the columns. We will do so by the **skiprows** and **names** parameters.

In [8]:
df2004 = xl.parse(sheet_name = 1, skiprows = [0,1], names = ['Country', 'AMR (2004)'])
df2004.head()

               Country  AMR (2004)
0              Algeria    3.407277
1              Andorra    0.000000
2               Angola    2.597931
3  Antigua and Barbuda    0.000000
4            Argentina    0.000000

Sometimes we are interested to import a particular column. We can do that as following:

In [15]:
df2004 = xl.parse(sheet_name = 1, usecols = 0, skiprows = [0], names = ['Country'])
df2004.head()

               Country
0              Albania
1              Algeria
2              Andorra
3               Angola
4  Antigua and Barbuda

There is another straightforward function available in pandas. **read_excel()** - parameters of this function are mostly similar to the **ExcelFile.parse()**.

In [20]:
data = pd.read_excel('battledeath.xlsx', sheet_name = '2002', names = ['country', 'AMR (2002)'])
data.head()

       country  AMR (2002)
0  Afghanistan   36.083990
1      Albania    0.128908
2      Algeria   18.314120
3      Andorra    0.000000
4       Angola   18.964560